; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob83) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 pallet13 pallet14 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 crate14 crate15 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate14)
	(at pallet1 depot1)
	(clear crate6)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear crate15)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear crate10)
	(at pallet6 depot0)
	(clear crate9)
	(at pallet7 distributor2)
	(clear crate7)
	(at pallet8 distributor2)
	(clear crate11)
	(at pallet9 depot1)
	(clear pallet9)
	(at pallet10 distributor1)
	(clear pallet10)
	(at pallet11 distributor0)
	(clear crate13)
	(at pallet12 distributor2)
	(clear crate12)
	(at pallet13 distributor0)
	(clear crate8)
	(at pallet14 distributor0)
	(clear pallet14)
	(at truck0 distributor2)
	(at truck1 depot1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor2)
	(available hoist6)
	(at hoist7 depot0)
	(available hoist7)
	(at hoist8 depot2)
	(available hoist8)
	(at hoist9 distributor1)
	(available hoist9)
	(at hoist10 distributor2)
	(available hoist10)
	(at hoist11 distributor0)
	(available hoist11)
	(at crate0 distributor2)
	(on crate0 pallet12)
	(at crate1 distributor0)
	(on crate1 pallet11)
	(at crate2 distributor0)
	(on crate2 crate1)
	(at crate3 depot0)
	(on crate3 pallet0)
	(at crate4 distributor2)
	(on crate4 pallet5)
	(at crate5 distributor0)
	(on crate5 crate2)
	(at crate6 depot1)
	(on crate6 pallet1)
	(at crate7 distributor2)
	(on crate7 pallet7)
	(at crate8 distributor0)
	(on crate8 pallet13)
	(at crate9 depot0)
	(on crate9 pallet6)
	(at crate10 distributor2)
	(on crate10 crate4)
	(at crate11 distributor2)
	(on crate11 pallet8)
	(at crate12 distributor2)
	(on crate12 crate0)
	(at crate13 distributor0)
	(on crate13 crate5)
	(at crate14 depot0)
	(on crate14 crate3)
	(at crate15 distributor0)
	(on crate15 pallet3)
)

(:goal (and
		(on crate0 pallet8)
		(on crate1 crate7)
		(on crate3 pallet12)
		(on crate5 pallet2)
		(on crate6 pallet13)
		(on crate7 crate9)
		(on crate8 pallet14)
		(on crate9 crate13)
		(on crate10 crate5)
		(on crate12 crate3)
		(on crate13 pallet6)
		(on crate14 pallet0)
		(on crate15 pallet9)
	)
))

; plan
1. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 0 of 13
2. (lift hoist6 crate10 crate4 distributor2)
   deleted: (at crate10 distributor2) (clear crate10) (available hoist6) (on crate10 crate4)
   added: (lifting hoist6 crate10) (clear crate4)
   goals met: 0 of 13
3. (load hoist6 crate10 truck0 distributor2)
   deleted: (lifting hoist6 crate10)
   added: (in crate10 truck0) (available hoist6)
   goals met: 0 of 13
4. (drive truck0 distributor2 distributor0)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor0)
   goals met: 0 of 13
5. (unload hoist3 crate10 truck0 distributor0)
   deleted: (in crate10 truck0) (available hoist3)
   added: (lifting hoist3 crate10)
   goals met: 0 of 13
6. (lift hoist6 crate12 crate0 distributor2)
   deleted: (at crate12 distributor2) (clear crate12) (available hoist6) (on crate12 crate0)
   added: (lifting hoist6 crate12) (clear crate0)
   goals met: 0 of 13
7. (lift hoist5 crate0 pallet12 distributor2)
   deleted: (at crate0 distributor2) (clear crate0) (available hoist5) (on crate0 pallet12)
   added: (lifting hoist5 crate0) (clear pallet12)
   goals met: 0 of 13
8. (lift hoist7 crate14 crate3 depot0)
   deleted: (at crate14 depot0) (clear crate14) (available hoist7) (on crate14 crate3)
   added: (lifting hoist7 crate14) (clear crate3)
   goals met: 0 of 13
9. (drive truck1 depot0 distributor2)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor2)
   goals met: 0 of 13
10. (load hoist6 crate12 truck1 distributor2)
   deleted: (lifting hoist6 crate12)
   added: (in crate12 truck1) (available hoist6)
   goals met: 0 of 13
11. (drive truck1 distributor2 depot0)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot0)
   goals met: 0 of 13
12. (lift hoist6 crate11 pallet8 distributor2)
   deleted: (at crate11 distributor2) (clear crate11) (available hoist6) (on crate11 pallet8)
   added: (lifting hoist6 crate11) (clear pallet8)
   goals met: 0 of 13
13. (drop hoist5 crate0 pallet8 distributor2)
   deleted: (lifting hoist5 crate0) (clear pallet8)
   added: (available hoist5) (at crate0 distributor2) (clear crate0) (on crate0 pallet8)
   goals met: 1 of 13
14. (lift hoist0 crate9 pallet6 depot0)
   deleted: (at crate9 depot0) (clear crate9) (available hoist0) (on crate9 pallet6)
   added: (lifting hoist0 crate9) (clear pallet6)
   goals met: 1 of 13
15. (load hoist0 crate9 truck1 depot0)
   deleted: (lifting hoist0 crate9)
   added: (in crate9 truck1) (available hoist0)
   goals met: 1 of 13
16. (lift hoist1 crate6 pallet1 depot1)
   deleted: (at crate6 depot1) (clear crate6) (available hoist1) (on crate6 pallet1)
   added: (lifting hoist1 crate6) (clear pallet1)
   goals met: 1 of 13
17. (drive truck1 depot0 depot1)
   deleted: (at truck1 depot0)
   added: (at truck1 depot1)
   goals met: 1 of 13
18. (load hoist1 crate6 truck1 depot1)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck1) (available hoist1)
   goals met: 1 of 13
19. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 1 of 13
20. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 1 of 13
21. (lift hoist0 crate3 pallet0 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 pallet0)
   added: (lifting hoist0 crate3) (clear pallet0)
   goals met: 1 of 13
22. (drop hoist7 crate14 pallet0 depot0)
   deleted: (lifting hoist7 crate14) (clear pallet0)
   added: (available hoist7) (at crate14 depot0) (clear crate14) (on crate14 pallet0)
   goals met: 2 of 13
23. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 2 of 13
24. (unload hoist7 crate12 truck1 depot0)
   deleted: (in crate12 truck1) (available hoist7)
   added: (lifting hoist7 crate12)
   goals met: 2 of 13
25. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 2 of 13
26. (drop hoist0 crate3 crate14 depot0)
   deleted: (lifting hoist0 crate3) (clear crate14)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 crate14)
   goals met: 2 of 13
27. (lift hoist5 crate7 pallet7 distributor2)
   deleted: (at crate7 distributor2) (clear crate7) (available hoist5) (on crate7 pallet7)
   added: (lifting hoist5 crate7) (clear pallet7)
   goals met: 2 of 13
28. (drive truck1 distributor0 distributor2)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor2)
   goals met: 2 of 13
29. (unload hoist10 crate9 truck1 distributor2)
   deleted: (in crate9 truck1) (available hoist10)
   added: (lifting hoist10 crate9)
   goals met: 2 of 13
30. (drop hoist10 crate9 pallet7 distributor2)
   deleted: (lifting hoist10 crate9) (clear pallet7)
   added: (available hoist10) (at crate9 distributor2) (clear crate9) (on crate9 pallet7)
   goals met: 2 of 13
31. (drop hoist5 crate7 crate9 distributor2)
   deleted: (lifting hoist5 crate7) (clear crate9)
   added: (available hoist5) (at crate7 distributor2) (clear crate7) (on crate7 crate9)
   goals met: 3 of 13
32. (drive truck1 distributor2 distributor0)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor0)
   goals met: 3 of 13
33. (lift hoist0 crate3 crate14 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 crate14)
   added: (lifting hoist0 crate3) (clear crate14)
   goals met: 3 of 13
34. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 3 of 13
35. (load hoist0 crate3 truck0 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck0) (available hoist0)
   goals met: 3 of 13
36. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   goals met: 3 of 13
37. (unload hoist5 crate3 truck0 distributor2)
   deleted: (in crate3 truck0) (available hoist5)
   added: (lifting hoist5 crate3)
   goals met: 3 of 13
38. (drop hoist5 crate3 pallet12 distributor2)
   deleted: (lifting hoist5 crate3) (clear pallet12)
   added: (available hoist5) (at crate3 distributor2) (clear crate3) (on crate3 pallet12)
   goals met: 4 of 13
39. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   goals met: 4 of 13
40. (load hoist7 crate12 truck0 depot0)
   deleted: (lifting hoist7 crate12)
   added: (in crate12 truck0) (available hoist7)
   goals met: 4 of 13
41. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   goals met: 4 of 13
42. (unload hoist5 crate12 truck0 distributor2)
   deleted: (in crate12 truck0) (available hoist5)
   added: (lifting hoist5 crate12)
   goals met: 4 of 13
43. (drop hoist5 crate12 crate3 distributor2)
   deleted: (lifting hoist5 crate12) (clear crate3)
   added: (available hoist5) (at crate12 distributor2) (clear crate12) (on crate12 crate3)
   goals met: 5 of 13
44. (lift hoist11 crate13 crate5 distributor0)
   deleted: (at crate13 distributor0) (clear crate13) (available hoist11) (on crate13 crate5)
   added: (lifting hoist11 crate13) (clear crate5)
   goals met: 5 of 13
45. (load hoist3 crate10 truck1 distributor0)
   deleted: (lifting hoist3 crate10)
   added: (in crate10 truck1) (available hoist3)
   goals met: 5 of 13
46. (load hoist11 crate13 truck1 distributor0)
   deleted: (lifting hoist11 crate13)
   added: (in crate13 truck1) (available hoist11)
   goals met: 5 of 13
47. (lift hoist3 crate15 pallet3 distributor0)
   deleted: (at crate15 distributor0) (clear crate15) (available hoist3) (on crate15 pallet3)
   added: (lifting hoist3 crate15) (clear pallet3)
   goals met: 5 of 13
48. (load hoist3 crate15 truck1 distributor0)
   deleted: (lifting hoist3 crate15)
   added: (in crate15 truck1) (available hoist3)
   goals met: 5 of 13
49. (lift hoist3 crate8 pallet13 distributor0)
   deleted: (at crate8 distributor0) (clear crate8) (available hoist3) (on crate8 pallet13)
   added: (lifting hoist3 crate8) (clear pallet13)
   goals met: 5 of 13
50. (drop hoist3 crate8 pallet14 distributor0)
   deleted: (lifting hoist3 crate8) (clear pallet14)
   added: (available hoist3) (at crate8 distributor0) (clear crate8) (on crate8 pallet14)
   goals met: 6 of 13
51. (unload hoist3 crate6 truck1 distributor0)
   deleted: (in crate6 truck1) (available hoist3)
   added: (lifting hoist3 crate6)
   goals met: 6 of 13
52. (drop hoist3 crate6 pallet13 distributor0)
   deleted: (lifting hoist3 crate6) (clear pallet13)
   added: (available hoist3) (at crate6 distributor0) (clear crate6) (on crate6 pallet13)
   goals met: 7 of 13
53. (unload hoist3 crate10 truck1 distributor0)
   deleted: (in crate10 truck1) (available hoist3)
   added: (lifting hoist3 crate10)
   goals met: 7 of 13
54. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 7 of 13
55. (unload hoist7 crate13 truck1 depot0)
   deleted: (in crate13 truck1) (available hoist7)
   added: (lifting hoist7 crate13)
   goals met: 7 of 13
56. (drive truck1 depot0 depot1)
   deleted: (at truck1 depot0)
   added: (at truck1 depot1)
   goals met: 7 of 13
57. (unload hoist1 crate15 truck1 depot1)
   deleted: (in crate15 truck1) (available hoist1)
   added: (lifting hoist1 crate15)
   goals met: 7 of 13
58. (drop hoist1 crate15 pallet9 depot1)
   deleted: (lifting hoist1 crate15) (clear pallet9)
   added: (available hoist1) (at crate15 depot1) (clear crate15) (on crate15 pallet9)
   goals met: 8 of 13
59. (drop hoist7 crate13 pallet6 depot0)
   deleted: (lifting hoist7 crate13) (clear pallet6)
   added: (available hoist7) (at crate13 depot0) (clear crate13) (on crate13 pallet6)
   goals met: 9 of 13
60. (lift hoist11 crate5 crate2 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist11) (on crate5 crate2)
   added: (lifting hoist11 crate5) (clear crate2)
   goals met: 9 of 13
61. (drive truck0 distributor2 distributor0)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor0)
   goals met: 9 of 13
62. (drop hoist11 crate5 pallet3 distributor0)
   deleted: (lifting hoist11 crate5) (clear pallet3)
   added: (available hoist11) (at crate5 distributor0) (clear crate5) (on crate5 pallet3)
   goals met: 9 of 13
63. (drop hoist3 crate10 crate5 distributor0)
   deleted: (lifting hoist3 crate10) (clear crate5)
   added: (available hoist3) (at crate10 distributor0) (clear crate10) (on crate10 crate5)
   goals met: 10 of 13
64. (lift hoist3 crate2 crate1 distributor0)
   deleted: (at crate2 distributor0) (clear crate2) (available hoist3) (on crate2 crate1)
   added: (lifting hoist3 crate2) (clear crate1)
   goals met: 10 of 13
65. (lift hoist11 crate1 pallet11 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist11) (on crate1 pallet11)
   added: (lifting hoist11 crate1) (clear pallet11)
   goals met: 10 of 13
66. (load hoist3 crate2 truck0 distributor0)
   deleted: (lifting hoist3 crate2)
   added: (in crate2 truck0) (available hoist3)
   goals met: 10 of 13
67. (load hoist11 crate1 truck0 distributor0)
   deleted: (lifting hoist11 crate1)
   added: (in crate1 truck0) (available hoist11)
   goals met: 10 of 13
68. (drive truck0 distributor0 distributor2)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor2)
   goals met: 10 of 13
69. (unload hoist5 crate1 truck0 distributor2)
   deleted: (in crate1 truck0) (available hoist5)
   added: (lifting hoist5 crate1)
   goals met: 10 of 13
70. (lift hoist11 crate10 crate5 distributor0)
   deleted: (at crate10 distributor0) (clear crate10) (available hoist11) (on crate10 crate5)
   added: (lifting hoist11 crate10) (clear crate5)
   goals met: 9 of 13
71. (lift hoist3 crate5 pallet3 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist3) (on crate5 pallet3)
   added: (lifting hoist3 crate5) (clear pallet3)
   goals met: 9 of 13
72. (drive truck1 depot1 distributor0)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor0)
   goals met: 9 of 13
73. (load hoist3 crate5 truck1 distributor0)
   deleted: (lifting hoist3 crate5)
   added: (in crate5 truck1) (available hoist3)
   goals met: 9 of 13
74. (drive truck1 distributor0 depot2)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot2)
   goals met: 9 of 13
75. (unload hoist8 crate5 truck1 depot2)
   deleted: (in crate5 truck1) (available hoist8)
   added: (lifting hoist8 crate5)
   goals met: 9 of 13
76. (drop hoist8 crate5 pallet2 depot2)
   deleted: (lifting hoist8 crate5) (clear pallet2)
   added: (available hoist8) (at crate5 depot2) (clear crate5) (on crate5 pallet2)
   goals met: 10 of 13
77. (drive truck1 depot2 distributor0)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor0)
   goals met: 10 of 13
78. (load hoist11 crate10 truck1 distributor0)
   deleted: (lifting hoist11 crate10)
   added: (in crate10 truck1) (available hoist11)
   goals met: 10 of 13
79. (drive truck1 distributor0 depot2)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot2)
   goals met: 10 of 13
80. (unload hoist8 crate10 truck1 depot2)
   deleted: (in crate10 truck1) (available hoist8)
   added: (lifting hoist8 crate10)
   goals met: 10 of 13
81. (drop hoist8 crate10 crate5 depot2)
   deleted: (lifting hoist8 crate10) (clear crate5)
   added: (available hoist8) (at crate10 depot2) (clear crate10) (on crate10 crate5)
   goals met: 11 of 13
82. (lift hoist10 crate7 crate9 distributor2)
   deleted: (at crate7 distributor2) (clear crate7) (available hoist10) (on crate7 crate9)
   added: (lifting hoist10 crate7) (clear crate9)
   goals met: 10 of 13
83. (load hoist6 crate11 truck0 distributor2)
   deleted: (lifting hoist6 crate11)
   added: (in crate11 truck0) (available hoist6)
   goals met: 10 of 13
84. (lift hoist6 crate9 pallet7 distributor2)
   deleted: (at crate9 distributor2) (clear crate9) (available hoist6) (on crate9 pallet7)
   added: (lifting hoist6 crate9) (clear pallet7)
   goals met: 10 of 13
85. (drop hoist10 crate7 pallet7 distributor2)
   deleted: (lifting hoist10 crate7) (clear pallet7)
   added: (available hoist10) (at crate7 distributor2) (clear crate7) (on crate7 pallet7)
   goals met: 10 of 13
86. (load hoist6 crate9 truck0 distributor2)
   deleted: (lifting hoist6 crate9)
   added: (in crate9 truck0) (available hoist6)
   goals met: 10 of 13
87. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   goals met: 10 of 13
88. (unload hoist7 crate9 truck0 depot0)
   deleted: (in crate9 truck0) (available hoist7)
   added: (lifting hoist7 crate9)
   goals met: 10 of 13
89. (drop hoist7 crate9 crate13 depot0)
   deleted: (lifting hoist7 crate9) (clear crate13)
   added: (available hoist7) (at crate9 depot0) (clear crate9) (on crate9 crate13)
   goals met: 11 of 13
90. (lift hoist6 crate7 pallet7 distributor2)
   deleted: (at crate7 distributor2) (clear crate7) (available hoist6) (on crate7 pallet7)
   added: (lifting hoist6 crate7) (clear pallet7)
   goals met: 11 of 13
91. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   goals met: 11 of 13
92. (load hoist6 crate7 truck0 distributor2)
   deleted: (lifting hoist6 crate7)
   added: (in crate7 truck0) (available hoist6)
   goals met: 11 of 13
93. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   goals met: 11 of 13
94. (unload hoist7 crate7 truck0 depot0)
   deleted: (in crate7 truck0) (available hoist7)
   added: (lifting hoist7 crate7)
   goals met: 11 of 13
95. (drop hoist7 crate7 crate9 depot0)
   deleted: (lifting hoist7 crate7) (clear crate9)
   added: (available hoist7) (at crate7 depot0) (clear crate7) (on crate7 crate9)
   goals met: 12 of 13
96. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   goals met: 12 of 13
97. (load hoist5 crate1 truck0 distributor2)
   deleted: (lifting hoist5 crate1)
   added: (in crate1 truck0) (available hoist5)
   goals met: 12 of 13
98. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   goals met: 12 of 13
99. (unload hoist7 crate1 truck0 depot0)
   deleted: (in crate1 truck0) (available hoist7)
   added: (lifting hoist7 crate1)
   goals met: 12 of 13
100. (drop hoist7 crate1 crate7 depot0)
   deleted: (lifting hoist7 crate1) (clear crate7)
   added: (available hoist7) (at crate1 depot0) (clear crate1) (on crate1 crate7)
   goals met: 13 of 13
